![Movies_ERD.png](Data/Movies_ERD.png)

In [102]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [103]:
import json
with open('/Users/dmusl/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [104]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/movies"
engine = create_engine(connection)
conn = engine.connect()

In [105]:
# Previewing the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [106]:
title_basics = pd.read_csv('Data/titles_filtered.csv', low_memory=False)

In [107]:
title_basics.head()

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [108]:
title_basics.dtypes

Unnamed: 0          int64
tconst             object
titleType          object
primaryTitle       object
originalTitle      object
isAdult             int64
startYear         float64
endYear           float64
runtimeMinutes      int64
genres             object
dtype: object

In [109]:
ratings = pd.read_csv('Data/ratings_filtered.csv', low_memory=False)

In [110]:
ratings.head()

   Unnamed: 0     tconst  averageRating  numVotes
0       17961  tt0035423            6.4     87153
1       40764  tt0062336            6.4       175
2       46645  tt0069049            6.7      7754
3       63640  tt0088751            5.2       336
4       69953  tt0096056            5.6       846

In [111]:
ratings.dtypes

Unnamed: 0         int64
tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [112]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [113]:
q= '''SELECT * FROM genres'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [genre_id, genre_name, created_at, updated_at]
Index: []

In [114]:
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,genre_id,int,NO,PRI,None,auto_increment
1,genre_name,varchar(45),YES,,None,
2,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [115]:
q= '''SELECT * FROM ratings'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [tconst, average_rating, number_of_votes, updated_at, created_at]
Index: []

In [116]:
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,tconst,varchar(12),NO,PRI,None,
1,average_rating,float,YES,,None,
2,number_of_votes,int,YES,,None,
3,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP
4,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED

In [117]:
# Checking describe's Field names
describe['Field'].values

array(['tconst', 'average_rating', 'number_of_votes', 'updated_at',
       'created_at'], dtype=object)

In [118]:
# Checking dataframe's columns
ratings.columns

Index(['Unnamed: 0', 'tconst', 'averageRating', 'numVotes'], dtype='object')

In [119]:
# Rename columns to match SQL table
rename_map = {"averageRating":"average_rating",
             "numVotes":"number_of_votes"}
ratings = ratings.rename(rename_map,axis=1)
ratings.head()

   Unnamed: 0     tconst  average_rating  number_of_votes
0       17961  tt0035423             6.4            87153
1       40764  tt0062336             6.4              175
2       46645  tt0069049             6.7             7754
3       63640  tt0088751             5.2              336
4       69953  tt0096056             5.6              846

In [120]:
# dropping columns to match the data to the table
ratings_table = ratings.drop(columns=['Unnamed: 0'])

In [121]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, conn)

   @@FOREIGN_KEY_CHECKS
0                     1

In [122]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [123]:
# Confirm the checks are deactiavated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q,conn)

   @@FOREIGN_KEY_CHECKS
0                     0

In [124]:
#inserting data
ratings_table.to_sql("ratings",conn,index=False, if_exists='append')

71900

In [125]:
# confirm the data has been added
q = """SELECT * FROM ratings;"""
pd.read_sql(q,conn)

,tconst,average_rating,number_of_votes,updated_at,created_at
0,tt0035423,6.4,87153,2023-10-13 00:05:39,2023-10-13 00:05:39
1,tt0062336,6.4,175,2023-10-13 00:05:39,2023-10-13 00:05:39
2,tt0069049,6.7,7754,2023-10-13 00:05:39,2023-10-13 00:05:39
3,tt0088751,5.2,336,2023-10-13 00:05:39,2023-10-13 00:05:39
4,tt0096056,5.6,846,2023-10-13 00:05:39,2023-10-13 00:05:39
...,...,...,...,...,...
71895,tt9914942,6.6,178,2023-10-13 00:05:42,2023-10-13 00:05:42
71896,tt9915872,6.4,9,2023-10-13 00:05:42,2023-10-13 00:05:42
71897,tt9916170,7.0,7,2023-10-13 00:05:42,2023-10-13 00:05:42
71898,tt9916190,3.7,243,2023-10-13 00:05:42,2023-10-13 00:05:42
71899,tt9916362,6.4,5422,2023-10-13 00:05:42,2023-10-13 00:05:42

In [126]:
q= '''SELECT * FROM title_basics'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [tconst, primary_title, start_year, runtime, created_at, updated_at]
Index: []

In [127]:
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,tconst,varchar(12),NO,PRI,None,
1,primary_title,varchar(242),YES,,None,
2,start_year,varchar(45),YES,,None,
3,runtime,int,YES,,None,
4,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
5,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [128]:
# Checking describe's Field names
describe['Field'].values

array(['tconst', 'primary_title', 'start_year', 'runtime', 'created_at',
       'updated_at'], dtype=object)

In [129]:
# Checking dataframe's columns
title_basics.columns

Index(['Unnamed: 0', 'tconst', 'titleType', 'primaryTitle', 'originalTitle',
       'isAdult', 'startYear', 'endYear', 'runtimeMinutes', 'genres'],
      dtype='object')

In [130]:
# Rename columns to match SQL table
rename_map = {"primaryTitle":"primary_title",
             "startYear":"start_year",
             "runtimeMinutes":"runtime"}
title_basics = title_basics.rename(rename_map,axis=1)
title_basics.head()

,Unnamed: 0,tconst,titleType,primary_title,originalTitle,isAdult,start_year,endYear,runtime,genres
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,93930,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [131]:
title_basics.dtypes

Unnamed: 0         int64
tconst            object
titleType         object
primary_title     object
originalTitle     object
isAdult            int64
start_year       float64
endYear          float64
runtime            int64
genres            object
dtype: object

In [132]:
# dropping columns to match the data to the table
titles_table = title_basics.drop(columns=['titleType', 'Unnamed: 0','originalTitle','isAdult','endYear','genres'])

In [133]:
titles_table.dtypes

tconst            object
primary_title     object
start_year       float64
runtime            int64
dtype: object

In [134]:
titles_table.to_sql("title_basics",conn,index=False, if_exists='append')

86979

In [135]:
# confirm the data has been added
q = """SELECT * FROM title_basics;"""
pd.read_sql(q,conn)

,tconst,primary_title,start_year,runtime,created_at,updated_at
0,tt0035423,Kate & Leopold,2001,118,2023-10-13 00:05:46,2023-10-13 00:05:46
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,2023-10-13 00:05:46,2023-10-13 00:05:46
2,tt0069049,The Other Side of the Wind,2018,122,2023-10-13 00:05:46,2023-10-13 00:05:46
3,tt0088751,The Naked Monster,2005,100,2023-10-13 00:05:46,2023-10-13 00:05:46
4,tt0096056,Crime and Punishment,2002,126,2023-10-13 00:05:46,2023-10-13 00:05:46
...,...,...,...,...,...,...
86974,tt9914942,Life Without Sara Amat,2019,74,2023-10-13 00:05:51,2023-10-13 00:05:51
86975,tt9915872,The Last White Witch,2019,97,2023-10-13 00:05:51,2023-10-13 00:05:51
86976,tt9916170,The Rehearsal,2019,51,2023-10-13 00:05:51,2023-10-13 00:05:51
86977,tt9916190,Safeguard,2020,95,2023-10-13 00:05:51,2023-10-13 00:05:51
86978,tt9916362,Coven,2020,92,2023-10-13 00:05:51,2023-10-13 00:05:51

In [136]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [137]:
q= '''SELECT * FROM genres LIMIT 5;'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [genre_id, genre_name, created_at, updated_at]
Index: []

In [138]:
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,genre_id,int,NO,PRI,None,auto_increment
1,genre_name,varchar(45),YES,,None,
2,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [139]:
q= '''SELECT * FROM title_genres LIMIT 5;'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [tconst, genre_id]
Index: []

In [140]:
q = '''DESCRIBE title_genres;'''
describe = pd.read_sql(q, engine)
describe

      Field         Type Null Key Default Extra
0    tconst  varchar(12)  YES        None
1  genre_id          int  YES        None

In [141]:
q= '''SELECT * FROM ratings
LIMIT 5'''
pd.read_sql(q, engine)

,tconst,average_rating,number_of_votes,updated_at,created_at
0,tt0035423,6.4,87153,2023-10-13 00:05:39,2023-10-13 00:05:39
1,tt0062336,6.4,175,2023-10-13 00:05:39,2023-10-13 00:05:39
2,tt0069049,6.7,7754,2023-10-13 00:05:39,2023-10-13 00:05:39
3,tt0088751,5.2,336,2023-10-13 00:05:39,2023-10-13 00:05:39
4,tt0096056,5.6,846,2023-10-13 00:05:39,2023-10-13 00:05:39

In [142]:
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,tconst,varchar(12),NO,PRI,None,
1,average_rating,float,YES,,None,
2,number_of_votes,int,YES,,None,
3,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP
4,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED

In [143]:
q= '''SELECT * FROM title_basics LIMIT 5;'''
pd.read_sql(q, engine)

,tconst,primary_title,start_year,runtime,created_at,updated_at
0,tt0035423,Kate & Leopold,2001,118,2023-10-13 00:05:46,2023-10-13 00:05:46
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,2023-10-13 00:05:46,2023-10-13 00:05:46
2,tt0069049,The Other Side of the Wind,2018,122,2023-10-13 00:05:46,2023-10-13 00:05:46
3,tt0088751,The Naked Monster,2005,100,2023-10-13 00:05:46,2023-10-13 00:05:46
4,tt0096056,Crime and Punishment,2002,126,2023-10-13 00:05:46,2023-10-13 00:05:46

In [144]:
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,tconst,varchar(12),NO,PRI,None,
1,primary_title,varchar(242),YES,,None,
2,start_year,varchar(45),YES,,None,
3,runtime,int,YES,,None,
4,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
5,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP